export const achievements: { [key: string]: string } = {
  "P_A": "初級問題出版者",
  "P_B": "中級問題出版者",
  "P_C": "上級問題出版者",
  "P_D": "超上級問題出版者",
  "G_A": "良記事ハンター",
  "G_B": "良記事コレクター",
  "G_C": "良記事探検家",
  "G_D": "良記事探しのプロ",
  "Q_A": "質問初心者",
  "Q_B": "質問上級者",
  "Q_C": "質問マスター",
  "Q_D": "質問の達人",
  "C_A": "コメント初心者",
  "C_B": "コメント上級者",
  "C_C": "コメントマスター",
  "C_D": "コメントの達人",
  "A_A": "灰色TellProer",
  "A_B": "茶色TellProer",
  "A_C": "緑色TellProer",
  "A_D": "水色TellProer",
  "A_E": "青色TellProer",
  "A_F": "黄色TellProer",
  "A_G": "橙色TellProer",
  "A_H": "赤色TellProer",
}

export const achievementsDescription: { [key: string]: string } = {
  "P_A": "問題集を1つ出した",
  "P_B": "問題集を5つ出した",
  "P_C": "問題集を10つ出した",
  "P_D": "問題集を30つ出した",
  "G_A": "1つの記事をいいねした",
  "G_B": "10つの記事をいいねした",
  "G_C": "50つの記事をいいねした",
  "G_D": "100つの記事をいいねした",
  "Q_A": "質問を1つした",
  "Q_B": "質問を5つした",
  "Q_C": "質問を10つした",
  "Q_D": "質問を30つした",
  "C_A": "コメントを1つした",
  "C_B": "コメントを5つした",
  "C_C": "コメントを10つした",
  "C_D": "コメントを30つした",
  "A_A": "記事を1つ投稿した",
  "A_B": "記事を5つ投稿した",
  "A_C": "記事を10つ投稿した",
  "A_D": "記事を30つ投稿した",
  "A_E": "記事を50つ投稿した",
  "A_F": "記事を100つ投稿した",
  "A_G": "記事を200つ投稿した",
  "A_H": "記事を300つ投稿した",
}
/*
P: Problem
G: Good
C: Comment
A: Article
Q: Question
*/